QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA28def.inc
.equ TCB2_CTRLA = 0x0B20                 ; Control A
.equ TCB2_CTRLB = 0x0B21                 ; Control Register B
.equ TCB2_EVCTRL = 0x0B24                ; Event Control
.equ TCB2_INTCTRL = 0x0B25               ; Interrupt Control
.equ TCB2_INTFLAGS = 0x0B26              ; Interrupt Flags
.equ TCB2_STATUS = 0x0B27                ; Status
.equ TCB2_DBGCTRL = 0x0B28               ; Debug Control
.equ TCB2_TEMP = 0x0B29                  ; Temporary Value
.equ TCB2_CNT = 0x0B2A                   ; Count
.equ TCB2_CNTL = 0x0B2A                  ; Count low byte
.equ TCB2_CNTH = 0x0B2B                  ; Count hi byte
.equ TCB2_CCMP = 0x0B2C                  ; Compare or Capture
.equ TCB2_CCMPL = 0x0B2C                 ; Compare or Capture low byte
.equ TCB2_CCMPH = 0x0B2D                 ; Compare or Capture hi byte

;*************************************************************************
;** TWI0 - Two-Wire Interface
;*************************************************************************

.equ TWI0_CTRLA = 0x0900                 ; Control A
.equ TWI0_DUALCTRL = 0x0901              ; Dual Mode Control
.equ TWI0_DBGCTRL = 0x0902               ; Debug Control
.equ TWI0_MCTRLA = 0x0903                ; Host Control A
.equ TWI0_MCTRLB = 0x0904                ; Host Control B
.equ TWI0_MSTATUS = 0x0905               ; Host STATUS
.equ TWI0_MBAUD = 0x0906                 ; Host Baud Rate
.equ TWI0_MADDR = 0x0907                 ; Host Address
.equ TWI0_MDATA = 0x0908                 ; Host Data
.equ TWI0_SCTRLA = 0x0909                ; Client Control A
.equ TWI0_SCTRLB = 0x090A                ; Client Control B
.equ TWI0_SSTATUS = 0x090B               ; Client Status
.equ TWI0_SADDR = 0x090C                 ; Client Address
.equ TWI0_SDATA = 0x090D                 ; Client Data
.equ TWI0_SADDRMASK = 0x090E             ; Client Address Mask

;*************************************************************************
;** USART0 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART0_RXDATAL = 0x0800             ; Receive Data Low Byte
.equ USART0_RXDATAH = 0x0801             ; Receive Data High Byte
.equ USART0_TXDATAL = 0x0802             ; Transmit Data Low Byte
.equ USART0_TXDATAH = 0x0803             ; Transmit Data High Byte
.equ USART0_STATUS = 0x0804              ; Status
.equ USART0_CTRLA = 0x0805               ; Control A
.equ USART0_CTRLB = 0x0806               ; Control B
.equ USART0_CTRLC = 0x0807               ; Control C
.equ USART0_BAUD = 0x0808                ; Baud Rate
.equ USART0_BAUDL = 0x0808               ; Baud Rate low byte
.equ USART0_BAUDH = 0x0809               ; Baud Rate hi byte
.equ USART0_CTRLD = 0x080A               ; Control D
.equ USART0_DBGCTRL = 0x080B             ; Debug Control
.equ USART0_EVCTRL = 0x080C              ; Event Control
.equ USART0_TXPLCTRL = 0x080D            ; IRCOM Transmitter Pulse Length Control
.equ USART0_RXPLCTRL = 0x080E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART1 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART1_RXDATAL = 0x0820             ; Receive Data Low Byte
.equ USART1_RXDATAH = 0x0821             ; Receive Data High Byte
.equ USART1_TXDATAL = 0x0822             ; Transmit Data Low Byte
.equ USART1_TXDATAH = 0x0823             ; Transmit Data High Byte
.equ USART1_STATUS = 0x0824              ; Status
.equ USART1_CTRLA = 0x0825               ; Control A
.equ USART1_CTRLB = 0x0826               ; Control B
.equ USART1_CTRLC = 0x0827               ; Control C
.equ USART1_BAUD = 0x0828                ; Baud Rate
.equ USART1_BAUDL = 0x0828               ; Baud Rate low byte
.equ USART1_BAUDH = 0x0829               ; Baud Rate hi byte
.equ USART1_CTRLD = 0x082A               ; Control D
.equ USART1_DBGCTRL = 0x082B             ; Debug Control
.equ USART1_EVCTRL = 0x082C              ; Event Control
.equ USART1_TXPLCTRL = 0x082D            ; IRCOM Transmitter Pulse Length Control
.equ USART1_RXPLCTRL = 0x082E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USART2 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART2_RXDATAL = 0x0840             ; Receive Data Low Byte
.equ USART2_RXDATAH = 0x0841             ; Receive Data High Byte
.equ USART2_TXDATAL = 0x0842             ; Transmit Data Low Byte
.equ USART2_TXDATAH = 0x0843             ; Transmit Data High Byte
.equ USART2_STATUS = 0x0844              ; Status
.equ USART2_CTRLA = 0x0845               ; Control A
.equ USART2_CTRLB = 0x0846               ; Control B
.equ USART2_CTRLC = 0x0847               ; Control C
.equ USART2_BAUD = 0x0848                ; Baud Rate
.equ USART2_BAUDL = 0x0848               ; Baud Rate low byte
.equ USART2_BAUDH = 0x0849               ; Baud Rate hi byte
.equ USART2_CTRLD = 0x084A               ; Control D
.equ USART2_DBGCTRL = 0x084B             ; Debug Control
.equ USART2_EVCTRL = 0x084C              ; Event Control
.equ USART2_TXPLCTRL = 0x084D            ; IRCOM Transmitter Pulse Length Control
.equ USART2_RXPLCTRL = 0x084E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USERROW - User Row
;*************************************************************************

.equ USERROW_USERROW0 = 0x1080           ; User Row Byte 0
.equ USERROW_USERROW1 = 0x1081           ; User Row Byte 1
.equ USERROW_USERROW2 = 0x1082           ; User Row Byte 2
.equ USERROW_USERROW3 = 0x1083           ; User Row Byte 3
.equ USERROW_USERROW4 = 0x1084           ; User Row Byte 4
.equ USERROW_USERROW5 = 0x1085           ; User Row Byte 5
.equ USERROW_USERROW6 = 0x1086           ; User Row Byte 6
.equ USERROW_USERROW7 = 0x1087           ; User Row Byte 7
.equ USERROW_USERROW8 = 0x1088           ; User Row Byte 8
.equ USERROW_USERROW9 = 0x1089           ; User Row Byte 9
.equ USERROW_USERROW10 = 0x108A          ; User Row Byte 10
.equ USERROW_USERROW11 = 0x108B          ; User Row Byte 11
.equ USERROW_USERROW12 = 0x108C          ; User Row Byte 12
.equ USERROW_USERROW13 = 0x108D          ; User Row Byte 13
.equ USERROW_USERROW14 = 0x108E          ; User Row Byte 14
.equ USERROW_USERROW15 = 0x108F          ; User Row Byte 15
.equ USERROW_USERROW16 = 0x1090          ; User Row Byte 16
.equ USERROW_USERROW17 = 0x1091          ; User Row Byte 17
.equ USERROW_USERROW18 = 0x1092          ; User Row Byte 18
.equ USERROW_USERROW19 = 0x1093          ; User Row Byte 19
.equ USERROW_USERROW20 = 0x1094          ; User Row Byte 20
.equ USERROW_USERROW21 = 0x1095          ; User Row Byte 21
.equ USERROW_USERROW22 = 0x1096          ; User Row Byte 22
.equ USERROW_USERROW23 = 0x1097          ; User Row Byte 23
.equ USERROW_USERROW24 = 0x1098          ; User Row Byte 24
.equ USERROW_USERROW25 = 0x1099          ; User Row Byte 25
.equ USERROW_USERROW26 = 0x109A          ; User Row Byte 26
.equ USERROW_USERROW27 = 0x109B          ; User Row Byte 27
.equ USERROW_USERROW28 = 0x109C          ; User Row Byte 28
.equ USERROW_USERROW29 = 0x109D          ; User Row Byte 29
.equ USERROW_USERROW30 = 0x109E          ; User Row Byte 30
.equ USERROW_USERROW31 = 0x109F          ; User Row Byte 31
.equ USERROW_USERROW32 = 0x10A0          ; User Row Byte 32
.equ USERROW_USERROW33 = 0x10A1          ; User Row Byte 33
.equ USERROW_USERROW34 = 0x10A2          ; User Row Byte 34
.equ USERROW_USERROW35 = 0x10A3          ; User Row Byte 35
.equ USERROW_USERROW36 = 0x10A4          ; User Row Byte 36
.equ USERROW_USERROW37 = 0x10A5          ; User Row Byte 37
.equ USERROW_USERROW38 = 0x10A6          ; User Row Byte 38
.equ USERROW_USERROW39 = 0x10A7          ; User Row Byte 39
.equ USERROW_USERROW40 = 0x10A8          ; User Row Byte 40
.equ USERROW_USERROW41 = 0x10A9          ; User Row Byte 41
.equ USERROW_USERROW42 = 0x10AA          ; User Row Byte 42
.equ USERROW_USERROW43 = 0x10AB          ; User Row Byte 43
.equ USERROW_USERROW44 = 0x10AC          ; User Row Byte 44
.equ USERROW_USERROW45 = 0x10AD          ; User Row Byte 45
.equ USERROW_USERROW46 = 0x10AE          ; User Row Byte 46
.equ USERROW_USERROW47 = 0x10AF          ; User Row Byte 47
.equ USERROW_USERROW48 = 0x10B0          ; User Row Byte 48
.equ USERROW_USERROW49 = 0x10B1          ; User Row Byte 49
.equ USERROW_USERROW50 = 0x10B2          ; User Row Byte 50
.equ USERROW_USERROW51 = 0x10B3          ; User Row Byte 51
.equ USERROW_USERROW52 = 0x10B4          ; User Row Byte 52
.equ USERROW_USERROW53 = 0x10B5          ; User Row Byte 53
.equ USERROW_USERROW54 = 0x10B6          ; User Row Byte 54
.equ USERROW_USERROW55 = 0x10B7          ; User Row Byte 55
.equ USERROW_USERROW56 = 0x10B8          ; User Row Byte 56
.equ USERROW_USERROW57 = 0x10B9          ; User Row Byte 57
.equ USERROW_USERROW58 = 0x10BA          ; User Row Byte 58
.equ USERROW_USERROW59 = 0x10BB          ; User Row Byte 59
.equ USERROW_USERROW60 = 0x10BC          ; User Row Byte 60
.equ USERROW_USERROW61 = 0x10BD          ; User Row Byte 61
.equ USERROW_USERROW62 = 0x10BE          ; User Row Byte 62
.equ USERROW_USERROW63 = 0x10BF          ; User Row Byte 63

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

