QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA28def.inc
; RTC_INTCTRL masks
.equ RTC_OVF_bm = 0x01                   ; Overflow Interrupt enable bit mask
.equ RTC_OVF_bp = 0                      ; Overflow Interrupt enable bit position
.equ RTC_CMP_bm = 0x02                   ; Compare Match Interrupt enable bit mask
.equ RTC_CMP_bp = 1                      ; Compare Match Interrupt enable bit position

; RTC_INTFLAGS masks
; Masks for RTC_OVF already defined
; Masks for RTC_CMP already defined

; RTC_DBGCTRL masks
.equ RTC_DBGRUN_bm = 0x01                ; Run in debug bit mask
.equ RTC_DBGRUN_bp = 0                   ; Run in debug bit position

; RTC_CALIB masks
.equ RTC_ERROR_gm = 0x7F                 ; Error Correction Value group mask
.equ RTC_ERROR_gp = 0                    ; Error Correction Value group position
.equ RTC_ERROR_0_bm = (1<<0)             ; Error Correction Value bit 0 mask
.equ RTC_ERROR_0_bp = 0                  ; Error Correction Value bit 0 position
.equ RTC_ERROR_1_bm = (1<<1)             ; Error Correction Value bit 1 mask
.equ RTC_ERROR_1_bp = 1                  ; Error Correction Value bit 1 position
.equ RTC_ERROR_2_bm = (1<<2)             ; Error Correction Value bit 2 mask
.equ RTC_ERROR_2_bp = 2                  ; Error Correction Value bit 2 position
.equ RTC_ERROR_3_bm = (1<<3)             ; Error Correction Value bit 3 mask
.equ RTC_ERROR_3_bp = 3                  ; Error Correction Value bit 3 position
.equ RTC_ERROR_4_bm = (1<<4)             ; Error Correction Value bit 4 mask
.equ RTC_ERROR_4_bp = 4                  ; Error Correction Value bit 4 position
.equ RTC_ERROR_5_bm = (1<<5)             ; Error Correction Value bit 5 mask
.equ RTC_ERROR_5_bp = 5                  ; Error Correction Value bit 5 position
.equ RTC_ERROR_6_bm = (1<<6)             ; Error Correction Value bit 6 mask
.equ RTC_ERROR_6_bp = 6                  ; Error Correction Value bit 6 position
.equ RTC_SIGN_bm = 0x80                  ; Error Correction Sign Bit bit mask
.equ RTC_SIGN_bp = 7                     ; Error Correction Sign Bit bit position

; RTC_CLKSEL masks
.equ RTC_CLKSEL_gm = 0x03                ; Clock Select group mask
.equ RTC_CLKSEL_gp = 0                   ; Clock Select group position
.equ RTC_CLKSEL_0_bm = (1<<0)            ; Clock Select bit 0 mask
.equ RTC_CLKSEL_0_bp = 0                 ; Clock Select bit 0 position
.equ RTC_CLKSEL_1_bm = (1<<1)            ; Clock Select bit 1 mask
.equ RTC_CLKSEL_1_bp = 1                 ; Clock Select bit 1 position

; RTC_PITCTRLA masks
.equ RTC_PITEN_bm = 0x01                 ; Enable bit mask
.equ RTC_PITEN_bp = 0                    ; Enable bit position
.equ RTC_PERIOD_gm = 0x78                ; Period group mask
.equ RTC_PERIOD_gp = 3                   ; Period group position
.equ RTC_PERIOD_0_bm = (1<<3)            ; Period bit 0 mask
.equ RTC_PERIOD_0_bp = 3                 ; Period bit 0 position
.equ RTC_PERIOD_1_bm = (1<<4)            ; Period bit 1 mask
.equ RTC_PERIOD_1_bp = 4                 ; Period bit 1 position
.equ RTC_PERIOD_2_bm = (1<<5)            ; Period bit 2 mask
.equ RTC_PERIOD_2_bp = 5                 ; Period bit 2 position
.equ RTC_PERIOD_3_bm = (1<<6)            ; Period bit 3 mask
.equ RTC_PERIOD_3_bp = 6                 ; Period bit 3 position

; RTC_PITSTATUS masks
.equ RTC_CTRLBUSY_bm = 0x01              ; CTRLA Synchronization Busy Flag bit mask
.equ RTC_CTRLBUSY_bp = 0                 ; CTRLA Synchronization Busy Flag bit position

; RTC_PITINTCTRL masks
.equ RTC_PI_bm = 0x01                    ; Periodic Interrupt bit mask
.equ RTC_PI_bp = 0                       ; Periodic Interrupt bit position

; RTC_PITINTFLAGS masks
; Masks for RTC_PI already defined

; RTC_PITDBGCTRL masks
; Masks for RTC_DBGRUN already defined

; RTC_PITEVGENCTRLA masks
.equ RTC_EVGEN0SEL_gm = 0x0F             ; Event Generation 0 Select group mask
.equ RTC_EVGEN0SEL_gp = 0                ; Event Generation 0 Select group position
.equ RTC_EVGEN0SEL_0_bm = (1<<0)         ; Event Generation 0 Select bit 0 mask
.equ RTC_EVGEN0SEL_0_bp = 0              ; Event Generation 0 Select bit 0 position
.equ RTC_EVGEN0SEL_1_bm = (1<<1)         ; Event Generation 0 Select bit 1 mask
.equ RTC_EVGEN0SEL_1_bp = 1              ; Event Generation 0 Select bit 1 position
.equ RTC_EVGEN0SEL_2_bm = (1<<2)         ; Event Generation 0 Select bit 2 mask
.equ RTC_EVGEN0SEL_2_bp = 2              ; Event Generation 0 Select bit 2 position
.equ RTC_EVGEN0SEL_3_bm = (1<<3)         ; Event Generation 0 Select bit 3 mask
.equ RTC_EVGEN0SEL_3_bp = 3              ; Event Generation 0 Select bit 3 position
.equ RTC_EVGEN1SEL_gm = 0xF0             ; Event Generation 1 Select group mask
.equ RTC_EVGEN1SEL_gp = 4                ; Event Generation 1 Select group position
.equ RTC_EVGEN1SEL_0_bm = (1<<4)         ; Event Generation 1 Select bit 0 mask
.equ RTC_EVGEN1SEL_0_bp = 4              ; Event Generation 1 Select bit 0 position
.equ RTC_EVGEN1SEL_1_bm = (1<<5)         ; Event Generation 1 Select bit 1 mask
.equ RTC_EVGEN1SEL_1_bp = 5              ; Event Generation 1 Select bit 1 position
.equ RTC_EVGEN1SEL_2_bm = (1<<6)         ; Event Generation 1 Select bit 2 mask
.equ RTC_EVGEN1SEL_2_bp = 6              ; Event Generation 1 Select bit 2 position
.equ RTC_EVGEN1SEL_3_bm = (1<<7)         ; Event Generation 1 Select bit 3 mask
.equ RTC_EVGEN1SEL_3_bp = 7              ; Event Generation 1 Select bit 3 position

; Clock Select
.equ RTC_CLKSEL_OSC32K_gc = (0x00<<0)    ; Internal 32.768 kHz Oscillator
.equ RTC_CLKSEL_OSC1K_gc = (0x01<<0)     ; Internal 32.768 kHz Oscillator Divided by 32
.equ RTC_CLKSEL_XOSC32K_gc = (0x02<<0)   ; 32.768 kHz Crystal Oscillator
.equ RTC_CLKSEL_EXTCLK_gc = (0x03<<0)    ; External Clock

; Prescaling Factor select
.equ RTC_PRESCALER_DIV1_gc = (0x00<<3)   ; RTC Clock / 1
.equ RTC_PRESCALER_DIV2_gc = (0x01<<3)   ; RTC Clock / 2
.equ RTC_PRESCALER_DIV4_gc = (0x02<<3)   ; RTC Clock / 4
.equ RTC_PRESCALER_DIV8_gc = (0x03<<3)   ; RTC Clock / 8
.equ RTC_PRESCALER_DIV16_gc = (0x04<<3)  ; RTC Clock / 16
.equ RTC_PRESCALER_DIV32_gc = (0x05<<3)  ; RTC Clock / 32
.equ RTC_PRESCALER_DIV64_gc = (0x06<<3)  ; RTC Clock / 64
.equ RTC_PRESCALER_DIV128_gc = (0x07<<3) ; RTC Clock / 128
.equ RTC_PRESCALER_DIV256_gc = (0x08<<3) ; RTC Clock / 256
.equ RTC_PRESCALER_DIV512_gc = (0x09<<3) ; RTC Clock / 512
.equ RTC_PRESCALER_DIV1024_gc = (0x0A<<3) ; RTC Clock / 1024
.equ RTC_PRESCALER_DIV2048_gc = (0x0B<<3) ; RTC Clock / 2048
.equ RTC_PRESCALER_DIV4096_gc = (0x0C<<3) ; RTC Clock / 4096
.equ RTC_PRESCALER_DIV8192_gc = (0x0D<<3) ; RTC Clock / 8192
.equ RTC_PRESCALER_DIV16384_gc = (0x0E<<3) ; RTC Clock / 16384
.equ RTC_PRESCALER_DIV32768_gc = (0x0F<<3) ; RTC Clock / 32768

; Period select
.equ RTC_PERIOD_OFF_gc = (0x00<<3)       ; Off
.equ RTC_PERIOD_CYC4_gc = (0x01<<3)      ; RTC Clock Cycles 4
.equ RTC_PERIOD_CYC8_gc = (0x02<<3)      ; RTC Clock Cycles 8
.equ RTC_PERIOD_CYC16_gc = (0x03<<3)     ; RTC Clock Cycles 16
.equ RTC_PERIOD_CYC32_gc = (0x04<<3)     ; RTC Clock Cycles 32
.equ RTC_PERIOD_CYC64_gc = (0x05<<3)     ; RTC Clock Cycles 64
.equ RTC_PERIOD_CYC128_gc = (0x06<<3)    ; RTC Clock Cycles 128
.equ RTC_PERIOD_CYC256_gc = (0x07<<3)    ; RTC Clock Cycles 256
.equ RTC_PERIOD_CYC512_gc = (0x08<<3)    ; RTC Clock Cycles 512
.equ RTC_PERIOD_CYC1024_gc = (0x09<<3)   ; RTC Clock Cycles 1024
.equ RTC_PERIOD_CYC2048_gc = (0x0A<<3)   ; RTC Clock Cycles 2048
.equ RTC_PERIOD_CYC4096_gc = (0x0B<<3)   ; RTC Clock Cycles 4096
.equ RTC_PERIOD_CYC8192_gc = (0x0C<<3)   ; RTC Clock Cycles 8192
.equ RTC_PERIOD_CYC16384_gc = (0x0D<<3)  ; RTC Clock Cycles 16384
.equ RTC_PERIOD_CYC32768_gc = (0x0E<<3)  ; RTC Clock Cycles 32768

; Event Generation 0 Select
.equ RTC_EVGEN0SEL_OFF_gc = (0x00<<0)    ; No Event Generated
.equ RTC_EVGEN0SEL_DIV4_gc = (0x01<<0)   ; CLK_RTC divided by 4
.equ RTC_EVGEN0SEL_DIV8_gc = (0x02<<0)   ; CLK_RTC divided by 8
.equ RTC_EVGEN0SEL_DIV16_gc = (0x03<<0)  ; CLK_RTC divided by 16
.equ RTC_EVGEN0SEL_DIV32_gc = (0x04<<0)  ; CLK_RTC divided by 32
.equ RTC_EVGEN0SEL_DIV64_gc = (0x05<<0)  ; CLK_RTC divided by 64
.equ RTC_EVGEN0SEL_DIV128_gc = (0x06<<0) ; CLK_RTC divided by 128
.equ RTC_EVGEN0SEL_DIV256_gc = (0x07<<0) ; CLK_RTC divided by 256
.equ RTC_EVGEN0SEL_DIV512_gc = (0x08<<0) ; CLK_RTC divided by 512
.equ RTC_EVGEN0SEL_DIV1024_gc = (0x09<<0) ; CLK_RTC divided by 1024
.equ RTC_EVGEN0SEL_DIV2048_gc = (0x0A<<0) ; CLK_RTC divided by 2048
.equ RTC_EVGEN0SEL_DIV4096_gc = (0x0B<<0) ; CLK_RTC divided by 4096
.equ RTC_EVGEN0SEL_DIV8192_gc = (0x0C<<0) ; CLK_RTC divided by 8192
.equ RTC_EVGEN0SEL_DIV16384_gc = (0x0D<<0) ; CLK_RTC divided by 16384
.equ RTC_EVGEN0SEL_DIV32768_gc = (0x0E<<0) ; CLK_RTC divided by 32768

