QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA28def.inc
; TWI_MADDR masks
.equ TWI_ADDR_gm = 0xFF                  ; Address group mask
.equ TWI_ADDR_gp = 0                     ; Address group position
.equ TWI_ADDR_0_bm = (1<<0)              ; Address bit 0 mask
.equ TWI_ADDR_0_bp = 0                   ; Address bit 0 position
.equ TWI_ADDR_1_bm = (1<<1)              ; Address bit 1 mask
.equ TWI_ADDR_1_bp = 1                   ; Address bit 1 position
.equ TWI_ADDR_2_bm = (1<<2)              ; Address bit 2 mask
.equ TWI_ADDR_2_bp = 2                   ; Address bit 2 position
.equ TWI_ADDR_3_bm = (1<<3)              ; Address bit 3 mask
.equ TWI_ADDR_3_bp = 3                   ; Address bit 3 position
.equ TWI_ADDR_4_bm = (1<<4)              ; Address bit 4 mask
.equ TWI_ADDR_4_bp = 4                   ; Address bit 4 position
.equ TWI_ADDR_5_bm = (1<<5)              ; Address bit 5 mask
.equ TWI_ADDR_5_bp = 5                   ; Address bit 5 position
.equ TWI_ADDR_6_bm = (1<<6)              ; Address bit 6 mask
.equ TWI_ADDR_6_bp = 6                   ; Address bit 6 position
.equ TWI_ADDR_7_bm = (1<<7)              ; Address bit 7 mask
.equ TWI_ADDR_7_bp = 7                   ; Address bit 7 position

; TWI_MDATA masks
.equ TWI_DATA_gm = 0xFF                  ; Data group mask
.equ TWI_DATA_gp = 0                     ; Data group position
.equ TWI_DATA_0_bm = (1<<0)              ; Data bit 0 mask
.equ TWI_DATA_0_bp = 0                   ; Data bit 0 position
.equ TWI_DATA_1_bm = (1<<1)              ; Data bit 1 mask
.equ TWI_DATA_1_bp = 1                   ; Data bit 1 position
.equ TWI_DATA_2_bm = (1<<2)              ; Data bit 2 mask
.equ TWI_DATA_2_bp = 2                   ; Data bit 2 position
.equ TWI_DATA_3_bm = (1<<3)              ; Data bit 3 mask
.equ TWI_DATA_3_bp = 3                   ; Data bit 3 position
.equ TWI_DATA_4_bm = (1<<4)              ; Data bit 4 mask
.equ TWI_DATA_4_bp = 4                   ; Data bit 4 position
.equ TWI_DATA_5_bm = (1<<5)              ; Data bit 5 mask
.equ TWI_DATA_5_bp = 5                   ; Data bit 5 position
.equ TWI_DATA_6_bm = (1<<6)              ; Data bit 6 mask
.equ TWI_DATA_6_bp = 6                   ; Data bit 6 position
.equ TWI_DATA_7_bm = (1<<7)              ; Data bit 7 mask
.equ TWI_DATA_7_bp = 7                   ; Data bit 7 position

; TWI_SCTRLA masks
; Masks for TWI_ENABLE already defined
; Masks for TWI_SMEN already defined
.equ TWI_PMEN_bm = 0x04                  ; Address Recognition Mode bit mask
.equ TWI_PMEN_bp = 2                     ; Address Recognition Mode bit position
.equ TWI_PIEN_bm = 0x20                  ; Stop Interrupt Enable bit mask
.equ TWI_PIEN_bp = 5                     ; Stop Interrupt Enable bit position
.equ TWI_APIEN_bm = 0x40                 ; Address or Stop Interrupt Enable bit mask
.equ TWI_APIEN_bp = 6                    ; Address or Stop Interrupt Enable bit position
.equ TWI_DIEN_bm = 0x80                  ; Data Interrupt Enable bit mask
.equ TWI_DIEN_bp = 7                     ; Data Interrupt Enable bit position

; TWI_SCTRLB masks
.equ TWI_SCMD_gm = 0x03                  ; Command group mask
.equ TWI_SCMD_gp = 0                     ; Command group position
.equ TWI_SCMD_0_bm = (1<<0)              ; Command bit 0 mask
.equ TWI_SCMD_0_bp = 0                   ; Command bit 0 position
.equ TWI_SCMD_1_bm = (1<<1)              ; Command bit 1 mask
.equ TWI_SCMD_1_bp = 1                   ; Command bit 1 position
; Masks for TWI_ACKACT already defined

; TWI_SSTATUS masks
.equ TWI_AP_bm = 0x01                    ; Address or Stop bit mask
.equ TWI_AP_bp = 0                       ; Address or Stop bit position
.equ TWI_DIR_bm = 0x02                   ; Read/Write Direction bit mask
.equ TWI_DIR_bp = 1                      ; Read/Write Direction bit position
; Masks for TWI_BUSERR already defined
.equ TWI_COLL_bm = 0x08                  ; Collision bit mask
.equ TWI_COLL_bp = 3                     ; Collision bit position
; Masks for TWI_RXACK already defined
; Masks for TWI_CLKHOLD already defined
.equ TWI_APIF_bm = 0x40                  ; Address or Stop Interrupt Flag bit mask
.equ TWI_APIF_bp = 6                     ; Address or Stop Interrupt Flag bit position
.equ TWI_DIF_bm = 0x80                   ; Data Interrupt Flag bit mask
.equ TWI_DIF_bp = 7                      ; Data Interrupt Flag bit position

; TWI_SADDR masks
; Masks for TWI_ADDR already defined

; TWI_SDATA masks
; Masks for TWI_DATA already defined

; TWI_SADDRMASK masks
.equ TWI_ADDREN_bm = 0x01                ; Address Mask Enable bit mask
.equ TWI_ADDREN_bp = 0                   ; Address Mask Enable bit position
.equ TWI_ADDRMASK_gm = 0xFE              ; Address Mask group mask
.equ TWI_ADDRMASK_gp = 1                 ; Address Mask group position
.equ TWI_ADDRMASK_0_bm = (1<<1)          ; Address Mask bit 0 mask
.equ TWI_ADDRMASK_0_bp = 1               ; Address Mask bit 0 position
.equ TWI_ADDRMASK_1_bm = (1<<2)          ; Address Mask bit 1 mask
.equ TWI_ADDRMASK_1_bp = 2               ; Address Mask bit 1 position
.equ TWI_ADDRMASK_2_bm = (1<<3)          ; Address Mask bit 2 mask
.equ TWI_ADDRMASK_2_bp = 3               ; Address Mask bit 2 position
.equ TWI_ADDRMASK_3_bm = (1<<4)          ; Address Mask bit 3 mask
.equ TWI_ADDRMASK_3_bp = 4               ; Address Mask bit 3 position
.equ TWI_ADDRMASK_4_bm = (1<<5)          ; Address Mask bit 4 mask
.equ TWI_ADDRMASK_4_bp = 5               ; Address Mask bit 4 position
.equ TWI_ADDRMASK_5_bm = (1<<6)          ; Address Mask bit 5 mask
.equ TWI_ADDRMASK_5_bp = 6               ; Address Mask bit 5 position
.equ TWI_ADDRMASK_6_bm = (1<<7)          ; Address Mask bit 6 mask
.equ TWI_ADDRMASK_6_bp = 7               ; Address Mask bit 6 position

; Fast-mode Enable select
.equ TWI_FMEN_OFF_gc = (0x00<<0)         ; SCL duty cycle operating according to Sm specification
.equ TWI_FMEN_ON_gc = (0x01<<0)          ; SCL duty cycle operating according to Fm specification

; Fast-mode Plus Enable select
.equ TWI_FMPEN_OFF_gc = (0x00<<1)        ; Operating in Standard-mode or Fast-mode
.equ TWI_FMPEN_ON_gc = (0x01<<1)         ; Operating in Fast-mode Plus

